tap "azure/functions"
tap "azure/kubelogin"
tap "codecrafters-io/tap"
tap "dapr/tap"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "jesseduffield/lazygit"
tap "azure/bicep"

brew "azure-cli"
brew "fzf", postinstall: "${HOMEBREW_PREFIX}/opt/fzf/install --all"
brew "neovim"
brew "node"
brew "podman"
brew "ripgrep"
brew "rustup"
brew "tmux"
brew "watch"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "uv"
brew "poetry"
brew "carapace"
brew "postgresql@16"
brew "lazygit"
brew "yq"
brew "bicep"
brew "golang"
brew "trivy"

cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "google-cloud-sdk", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"
cask "iterm2"
cask "rectangle"
cask "drawio"
cask "github-copilot-for-xcode"
cask "font-cascadia-mono-nf"
