is_work = ENV["PERSONAL_MACHINE"].to_s.strip.empty?

tap "azure/bicep"
tap "azure/functions"
tap "codecrafters-io/tap"
if is_work
  tap "azure/kubelogin"
  tap "derailed/k9s"
  tap "fluxcd/tap"
  tap "atlassian/homebrew-acli"
end
tap "jesseduffield/lazygit"
tap "probe-rs/probe-rs"
tap "sst/tap"

brew "acli"
if is_work
  brew "awscli"
  brew "helm"
  brew "k9s"
  brew "ktop"
  brew "kubectl"
end
brew "azcopy"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bicep"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fnm" # Node version manager
brew "fzf", postinstall: "${HOMEBREW_PREFIX}/opt/fzf/install --all"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "gpg"
brew "lazydocker"
brew "lazygit"
brew "llm"
brew "neovim"
brew "opencode"
brew "pinentry-mac"
brew "podman"
brew "poetry"
brew "postgresql@16"
brew "pre-commit"
brew "probe-rs"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "trivy"
brew "uv"
brew "watch"
brew "watchexec"
brew "yazi"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"

if is_work
  cask "corretto@21"
  cask "gcloud-cli", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"
end
cask "drawio"
cask "font-cascadia-mono-nf"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "github-copilot-for-xcode"
cask "iterm2"
cask "rectangle"
