tap "azure/bicep"
tap "azure/functions"
tap "azure/kubelogin"
tap "codecrafters-io/tap"
tap "dapr/tap"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "jesseduffield/lazygit"
tap "probe-rs/probe-rs"

brew "azcopy"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bicep"
brew "direnv"
brew "ffmpeg"
brew "fnm" # Node version manager
brew "fzf", postinstall: "${HOMEBREW_PREFIX}/opt/fzf/install --all"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "golang"
brew "gpg"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "pinentry-mac"
brew "podman"
brew "poetry"
brew "postgresql@16"
brew "probe-rs"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "trivy"
brew "uv"
brew "watch"
brew "watchexec"
brew "yazi"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"

cask "drawio"
cask "font-cascadia-mono-nf"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "github-copilot-for-xcode"
cask "gcloud-cli", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"
cask "iterm2"
cask "powershell"
cask "rectangle"
