tap "azure/bicep"
tap "azure/functions"
tap "azure/kubelogin"
tap "codecrafters-io/tap"
tap "jesseduffield/lazygit"
tap "probe-rs/probe-rs"
tap "sst/tap"

brew "age"
brew "azcopy"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bat"
brew "bicep"
brew "cloudflared"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm" # Node version manager
brew "fzf", postinstall: "${HOMEBREW_PREFIX}/opt/fzf/install --all"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "gpg"
brew "hugo"
brew "jqp"
brew "just"
brew "k3d"
brew "kubectl"
brew "Azure/kubelogin/kubelogin"
brew "krew"
brew "derailed/k9s/k9s"
brew "lazydocker"
brew "lazygit"
brew "llm"
brew "mise"
brew "neovim"
brew "opencode"
brew "pinentry-mac"
brew "podman"
brew "poetry"
brew "postgresql@16"
brew "pre-commit"
brew "probe-rs"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "tlrc"
brew "tmux"
brew "trivy"
brew "uv"
brew "watch"
brew "watchexec"
brew "witr"
brew "yazi"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"

cask "drawio"
cask "font-cascadia-mono-nf"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "github-copilot-for-xcode"
cask "iterm2"
cask "rectangle"
cask "secretive"

# Include a local Brewfile if present (supports both global and project contexts)
brewfile_dir = File.expand_path(File.dirname(__FILE__))
local_brewfile_path = File.join(brewfile_dir, "Brewfile.local")
if File.exist?(local_brewfile_path)
  instance_eval(File.read(local_brewfile_path))
end
