tap "azure/bicep", trusted: true
tap "azure/functions", trusted: true
tap "codecrafters-io/tap"
tap "jesseduffield/lazygit", trusted: true
tap "probe-rs/probe-rs", trusted: true
tap "sst/tap"

cask "nikitabobko/tap/aerospace", trusted: true
brew "age"
brew "argocd"
brew "azcopy"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bat"
brew "bicep"
brew "felixkratz/formulae/borders", trusted: true
brew "cloudflared"
brew "cmatrix"
brew "container", restart_service: true
brew "coreutils"
brew "crane"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm" # Node version manager
brew "fzf", postinstall: "${HOMEBREW_PREFIX}/opt/fzf/install --all"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "gpg"
brew "grafanactl"
brew "helm"
brew "hugo"
brew "hunk"
brew "jqp"
brew "just"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k3d"
brew "kubectl"
brew "kubecolor"
brew "kubeconform"
brew "kustomize"
brew "Azure/kubelogin/kubelogin", trusted: true
brew "krew"
brew "derailed/k9s/k9s", trusted: true
brew "lazydocker"
brew "lazygit"
brew "llm"
brew "mlx-lm"
brew "neofetch"
brew "neovim"
brew "opencode"
brew "pinentry-mac"
brew "podman"
brew "poetry"
brew "postgresql@16"
brew "pre-commit"
brew "probe-rs"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "talosctl"
brew "tlrc"
brew "tmux"
brew "tree-sitter-cli"
brew "trivy"
brew "uv"
brew "watch"
brew "watchexec"
brew "witr"
brew "yazi"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"

cargo "cargo-msrv"
cargo "cargo-outdated"
cargo "cargo-udeps"
cargo "cargo-watch"
cargo "esp-generate"
cargo "espflash"
cargo "cargo-run-bin"
cargo "cargo-autoinherit"

go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/gopls"

krew "edit-status"
krew "revisions"
krew "tree"
krew "who-can"

cask "drawio"
cask "font-cascadia-mono-nf"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "github-copilot-for-xcode"
cask "iterm2"
cask "raycast"
cask "rectangle"
cask "secretive"

# Include a local Brewfile if present (supports both global and project contexts)
brewfile_dir = File.expand_path(File.dirname(__FILE__))
local_brewfile_path = File.join(brewfile_dir, "Brewfile.local")
if File.exist?(local_brewfile_path)
  instance_eval(File.read(local_brewfile_path))
end

